README.org
# -*- mode: org; fill-column: 60; -*-
#+STARTUP: showall indent hidestars

* Intro

У нас есть 4 трека, каждый из них может одновременно вести
несколько голосований.

Я пока не придумал ничего лучше, чем положить все
настраиваемые параметры в структуру голосования.

По сути треки отличаются только базовыми настройками этих
голосований. Мы можем сделать их отдельными контрактами.

Для всех голосований предложение считается принятым, если до
его окончания не было получено достаточно возражений.

Tracks variants:
- validators requests
- grant distibution
- payments of rewards
- regular insurance payments

* Init

Переменная для хранения ~owner~-а

#+BEGIN_SRC vyper :noweb-ref data
  owner: public(address)
#+END_SRC

При инициализации запоминаем, кто ~owner~:

#+BEGIN_SRC vyper :noweb-ref init
  self.owner = msg.sender
#+END_SRC

Init нужен чтобы определить, кто может добавлять тех, кому
разрешено начинать голосование. По идее, только контракт
всеобщего голосования DAO может сделать это. Но, насколько я
понял, мы избегаем апгрейда DAO-контрактов, поэтому пока
рулит всем ~owner~.

[TODO:gmm] - Разобраться, как можно интегрироваться со
всеобщим голосованием DAO

* Ownership

Проверка ~onlyOwner~:

#+NAME: only_owner
#+BEGIN_SRC vyper
  assert msg.sender == self.owner
#+END_SRC

Надо уметь трансферить ~owner~-а:

#+NAME: transfer_ownership
#+BEGIN_SRC vyper :noweb yes
  @external
  def transferOwnership(_new_owner: address):
      <<only_owner>>
      self.owner = _new_owner
#+END_SRC

* Ballot Makers

Только "узкий круг ограниченных людей" может начинать
голосования. Храним их в мапе:

#+BEGIN_SRC vyper :noweb-ref data
  ballot_makers: public(HashMap[address, bool])
#+END_SRC

Проверка, что ~ballot maker~ относится к этому кругу людей:

#+NAME: only_ballot_maker
#+BEGIN_SRC vyper
  assert self.ballot_makers[msg.sender] == True
#+END_SRC

~Owner~ может добавлять и удалять ~ballot makers~:

#+NAME: add_ballot_maker
#+BEGIN_SRC vyper :noweb yes
  @external
  def add_ballot_maker(_param: address):
      <<only_owner>>
      self.ballot_makers[_param] = True
#+END_SRC

#+NAME: del_ballot_maker
#+BEGIN_SRC vyper :noweb yes
  @external
  def del_ballot_maker(_param: address):
      <<only_owner>>
      self.ballot_makers[_param] = False
#+END_SRC

* Ballot Time

Мы считаем голосование завершенным, если одно из условий

Мы считаем голосование завершенным, если одно из условий
истинно:
- текущее время блока больше чем значение поля deadline
- вес возражений выше порога возражений

Для этого нам нужны соответствующие поля в структуре
голосования:

#+BEGIN_SRC vyper :noweb-ref struct_ballot
  deadline: uint256
  objections_total_weight: uint256
#+END_SRC

И функция, которая проверят, завершено ли голосование

#+NAME: is_ballot_finished
#+BEGIN_SRC vyper
  # @external
  # def is_ballot_finished(_ballot_id: uint256) -> bool:
  #     if ( block.timestamp > self.ballots[_ballot_id].deadline ):
  #        return True
  #     if ( objections_threshold > ballots[_ballot_id].objections_total_weight ):
  #        return True
  #     return False
#+END_SRC

Для разных треков может быть разное время голосования,
поэтому нужно поле для хранения установленного времени:

#+BEGIN_SRC vyper :noweb-ref data
  ballot_time: public(uint256)
#+END_SRC

Будем инициализировать это поле при иницализации контракта:

#+BEGIN_SRC vyper :noweb-ref init
  self.ballot_time = _ballot_time
#+END_SRC

из соответствующего параметра:

#+BEGIN_SRC vyper :noweb-ref init_params
  _ballot_time: uint256,
#+END_SRC

* Make Ballot

Возможна атака, когда ~ballot maker~ создает много
голосований, в рассчете на то, у возражающих не хватит
стейка чтобы возразить по всем голосованиям и какая-то часть
голосований пройдет без возражений. Например, так можно
выводить деньги на грантовые программы. Даже если гранты
переводятся на мультисиг, это требует только договоренности
с владельцами мультисига, которые тоже могут иметь
заинтересованность в выводе денег.

Была идея, чтобы возможность создавать easy-track
голосования была как-то привязана к LDO-токенам.

Мы могли бы заблокировать токены двумя способами:
- перевести их на контракт, и после окончания голосования
  дать возможность забрать
- запретить их трансфер на время голосования, вызвав
  токен-менеджер (требует апгрейда токен-менеджера)

(Токен-менеджер - это контракт, который позволяет увидеть
сколько у адреса токенов, которые он пока не может
трансферить из-за вестинга. Смотреть тут:
https://github.com/aragon/aragon-apps/tree/master/apps/token-manager/contracts)

Мы не хотим апгрейдить токен-менеджер, т.к. это требует
много телодвижений с аудитом и вообще это непросто. Но если
мы захотим это делать, то можем включить нужный функционал в
другие изменения.

Еще один аспект, как минимум, по validator's easy-track:
адрес, на котором валидаторы хотят работать с изи-треком не
обязан совпадать с адресом на котором они держать
LDO-токены. Также, так как валидаторы добавляются ~owner~-ом
то им не нужен минимальный стейк для создания голосования.

Таким образом, мы контролируем тех, кто создает голосование,
и если начинается спам - оперативно удаляем его. Поэтому
дополнительные механизмы связанные с LDO-токенами не
нужны. [TODO:gmm] - Но нужен механизм отмены спаммерских
голосований тогда.


Голосования нумеруются начиная с единицы, текущенной номер
хранится в соотвествующей переменной:

#+BEGIN_SRC vyper :noweb-ref data
  next_ballot_index: public(uint256)
#+END_SRC

Она должна быть проинициализирована, когда контракт
создается:

#+BEGIN_SRC vyper :noweb-ref init
  self.next_ballot_index = 1
#+END_SRC

[TODO:gmm] - Возможно нужно минимальное время между
попытками одного пользователя создать новое голосование?

Функция создания голосования:

#+NAME: make_ballot
#+BEGIN_SRC vyper :noweb yes
  @external
  def make_ballot(_ballotHash: bytes32):
      <<only_ballot_maker>>
      self.ballots[self.next_ballot_index] = Ballot({
          deadline: block.timestamp + self.ballot_time,
          objections_total_weight: 0,
          ballot_maker: msg.sender,
          snapshot_block: block.number - 1
      })
      <<set_snapshot_block>>
      self.next_ballot_index = self.next_ballot_index + 1
#+END_SRC

Для нее в структуре голосования нам нужны поля:

#+BEGIN_SRC vyper :noweb-ref struct_ballot
  ballot_maker: address
#+END_SRC

[TODO:gmm] - Для validator's easy track мы хотим проверять,
что адрес, который создает голосование есть в Node Operator
Registry. См. строчку 273 в файле:
https://github.com/lidofinance/lido-dao/blob/master/contracts/0.4.24/nos/NodeOperatorsRegistry.sol

#+BEGIN_EXAMPLE solidity
  require(msg.sender == operators[_operator_id].rewardAddress, "APP_AUTH_FAILED");
#+END_EXAMPLE

Тут мы должны будем передавать operator_id в функцию
создания голосования. Мапа operators объявлена как internal,
но есть функция getNodeOperator которая view accessor для
этой мапы, и [TODO:gmm] - ее можно заюзать через интерфейс.

