README.md

# Table of Contents

1.  [Intro](#org359d9a8)
2.  [Init](#org9842a3d)
3.  [Ownership](#orgecd16ed)
4.  [Ballot Makers](#org80926e1)
5.  [Ballot Time](#orgb5614c9)
6.  [Make Ballot](#org7ddfbba)
7.  [Send objection](#org218bcba)
8.  [Ballot](#orge0905d7)
9.  [Ballot Endings](#org9174c4d)
10. [Other task and todoes](#orge015254)
11. [Tangle](#org3dadba5)
12. [Tests](#org16132e2)



<a id="org359d9a8"></a>

# Intro

У нас есть 4 трека, каждый из них может одновременно вести
несколько голосований.

Я пока не придумал ничего лучше, чем положить все
настраиваемые параметры в структуру голосования.

По сути треки отличаются только базовыми настройками этих
голосований. Мы можем сделать их отдельными контрактами.

Для всех голосований предложение считается принятым, если до
его окончания не было получено достаточно возражений.

Tracks variants:

-   validators requests
-   grant distibution
-   payments of rewards
-   regular insurance payments


<a id="org9842a3d"></a>

# Init

Переменная для хранения `owner`-а

    owner: public(address)

При инициализации запоминаем, кто `owner`:

    self.owner = msg.sender

Init нужен чтобы определить, кто может добавлять тех, кому
разрешено начинать голосование. По идее, только контракт
всеобщего голосования DAO может сделать это. Но, насколько я
понял, мы избегаем апгрейда DAO-контрактов, поэтому пока
рулит всем `owner`.

[TODO:gmm] - Разобраться, как можно интегрироваться со
всеобщим голосованием DAO


<a id="orgecd16ed"></a>

# Ownership

Проверка `onlyOwner`:

    assert msg.sender = self.owner

Надо уметь трансферить `owner`-а:

    @external
    def transferOwnership(_new_owner: address):
        assert msg.sender = self.owner
        self.owner = _new_owner


<a id="org80926e1"></a>

# Ballot Makers

Только "узкий круг ограниченных людей" может начинать
голосования. Храним их в мапе:

    ballot_makers: public(HashMap[address, bool])

Проверка, что `ballot maker` относится к этому кругу людей:

    assert ballot_makers[msg.sender] = True

`Owner` может добавлять и удалять `ballot makers`:

    @external
    def add_ballot_maker(_param: address):
        assert msg.sender = self.owner
        ballot_makers[_param] = True

    @external
    def del_ballot_maker(_param: address):
        assert msg.sender = self.owner
        ballot_makers[_param] = False


<a id="orgb5614c9"></a>

# Ballot Time

Мы считаем голосование завершенным, если одно из условий

Мы считаем голосование завершенным, если одно из условий
истинно:

-   текущее время блока больше чем значение поля deadline
-   вес возражений выше порога возражений

Для этого нам нужны соответствующие поля в структуре
голосования:

    deadline: uint256
    objections_total_weight: uint256

И функция, которая проверят, завершено ли голосование

    @external
    def is_ballot_finished(_ballot_id: uint256):
        if ( block.timestamp > ballots[_ballot_id].deadline ):
           return True
        if ( objections_threshold > ballots[_ballot_id].objections_total_weight ):
           return True
        return False

Для разных треков может быть разное время голосования,
поэтому нужно поле для хранения установленного времени:

    ballot_time: public(uint256)

Будем инициализировать это поле при иницализации контракта:

    self.ballot_time = _ballot_time

из соответствующего параметра:

    _ballot_time: uint256,


<a id="org7ddfbba"></a>

# Make Ballot

Возможна атака, когда `ballot maker` создает много
голосований, в рассчете на то, у возражающих не хватит
стейка чтобы возразить по всем голосованиям и какая-то часть
голосований пройдет без возражений. Например, так можно
выводить деньги на грантовые программы. Даже если гранты
переводятся на мультисиг, это требует только договоренности
с владельцами мультисига, которые тоже могут иметь
заинтересованность в выводе денег.

Была идея, чтобы возможность создавать easy-track
голосования была как-то привязана к LDO-токенам.

Мы могли бы заблокировать токены двумя способами:

-   перевести их на контракт, и после окончания голосования
    дать возможность забрать
-   запретить их трансфер на время голосования, вызвав
    токен-менеджер (требует апгрейда токен-менеджера)

(Токен-менеджер - это контракт, который позволяет увидеть
сколько у адреса токенов, которые он пока не может
трансферить из-за вестинга. Смотреть тут:
<https://github.com/aragon/aragon-apps/tree/master/apps/token-manager/contracts>)

Мы не хотим апгрейдить токен-менеджер, т.к. это требует
много телодвижений с аудитом и вообще это непросто. Но если
мы захотим это делать, то можем включить нужный функционал в
другие изменения.

Еще один аспект, как минимум, по validator's easy-track:
адрес, на котором валидаторы хотят работать с изи-треком не
обязан совпадать с адресом на котором они держать
LDO-токены. Также, так как валидаторы добавляются `owner`-ом
то им не нужен минимальный стейк для создания голосования.

Таким образом, мы контролируем тех, кто создает голосование,
и если начинается спам - оперативно удаляем его. Поэтому
дополнительные механизмы связанные с LDO-токенами не
нужны. [TODO:gmm] - Но нужен механизм отмены спаммерских
голосований тогда.

Голосования нумеруются начиная с единицы, текущенной номер
хранится в соотвествующей переменной:

    next_ballot_index: public(uint256)

Она должна быть проинициализирована, когда контракт
создается:

    self.next_ballot_index = 1

[TODO:gmm] - Возможно нужно минимальное время между
попытками одного пользователя создать новое голосование?

Функция создания голосования:

    @public
    def make_ballot(_ballotHash: bytes32):
        assert ballot_makers[msg.sender] = True
        self.ballots[self.next_ballot_index] = Ballot({
            ballot_maker = msg.sender
            deadline = block.timestamp + self.ballot_time,
        })
        self.next_ballot_index = self.next_ballot_index + 1

Для нее в структуре голосования нам нужны поля:

    ballot_maker: address

[TODO:gmm] - Для validator's easy track мы хотим проверять,
что адрес, который создает голосование есть в Node Operator
Registry. См. строчку 273 в файле:
<https://github.com/lidofinance/lido-dao/blob/master/contracts/0.4.24/nos/NodeOperatorsRegistry.sol>

    require(msg.sender == operators[_operator_id].rewardAddress, "APP_AUTH_FAILED");

Тут мы должны будем передавать operator<sub>id</sub> в функцию
создания голосования. Мапа operators объявлена как internal,
но есть функция getNodeOperator которая view accessor для
этой мапы, и [TODO:gmm] - ее можно заюзать через интерфейс.
